In [1]:
import pandas as pd

## Построение DataFrame из нескольких файлов (объединение по строкам)

In [2]:
pd.read_csv('files/stocks1.csv')

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [3]:
pd.read_csv('files/stocks2.csv')

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [4]:
pd.read_csv('files/stocks3.csv')

         Date   Close    Volume Symbol
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [5]:
from glob import glob

#### Вы можете передать функции glob() шаблон, включая символы подстановки, и он вернет список всех файлов, соответствующих этому шаблону.

#### В данном случае glob ищет в подкаталоге "files" все CSV-файлы, начинающиеся со слова "stocks"

In [6]:
stock_files = sorted(glob('files/stocks*.csv'))
stock_files

['files\\stocks1.csv', 'files\\stocks2.csv', 'files\\stocks3.csv']

glob возвращает имена файлов в произвольном порядке, поэтому мы отсортировали список с помощью встроенной в Python функции sorted().

Затем мы можем использовать выражение-генератор для чтения каждого из файлов с помощью read_csv() и передать результаты в функцию concat(), которая объединит строки в один DataFrame:

In [7]:
pd.concat((pd.read_csv(file) for file in stock_files))

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

## Построение DataFrame из нескольких файлов (объединение по столбцам)

In [8]:
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [9]:
pd.read_csv('files/drinks1.csv').head()

       country  beer_servings  spirit_servings
0  Afghanistan              0                0
1      Albania             89              132
2      Algeria             25                0
3      Andorra            245              138
4       Angola            217               57

In [10]:
pd.read_csv('files/drinks2.csv').head()

   wine_servings  total_litres_of_pure_alcohol continent
0              0                           0.0      Asia
1             54                           4.9    Europe
2             14                           0.7    Africa
3            312                          12.4    Europe
4             45                           5.9    Africa

In [11]:
drink_files = sorted(glob('files/drinks*.csv'))
drink_files

['files\\drinks1.csv', 'files\\drinks2.csv']

In [12]:
pd.concat((pd.read_csv(file) for file in drink_files), axis='columns').head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa